app/Controllers/Empleados.php

SELECT *
FROM `empleados`
---
    public function index()
    {
        $data = [
            'title' => '',
            'content' => 'Empleados/View/view',
            'scripts' => 'Empleados/View/view_scripts',
            'empleados' => $this->EmpleadosModels->findAll()
        ];

SELECT *
FROM `empleados`
---
    public function create()
    {
        $data = [
            'title' => 'Crear nuevo empleado',
            'content' => 'Empleados/Create/view',
            'scripts' => 'Empleados/Create/view_scripts',
            'empleados' => $this->EmpleadosModels->findAll()

SELECT *
FROM `empleados`
WHERE `empleados`.`id` = 5
---
    public function edit(Int $id)
    {
        $empleado = $this->EmpleadosModels->find($id);

INSERT INTO `empleados` (`code`, `name`, `surname`, `identity`, `address`, `telephone`, `photo_id`) VALUES ('0988786', 'Tester Mario', 'Carrero', '6563456', 'Calle 23 # 45 89', '1243252364', '/uploads/employees/0988786/20231010022904_whatsappimage2023-10-09at163939.jpeg')
UPDATE `empleados` SET `code` = '4737', `name` = 'Tester Mario', `surname` = 'etw4', `identity` = '57458458', `address` = 'Calle 23', `telephone` = '347347', `id` = '5', `photo_id` = ('The file has already been moved.')
WHERE `empleados`.`id` IN ('5')
---
    public function save()
    {

        $dataForm = $this->request->getPost();

        /* var_dump($_FILES['photo_id']);
        var_dump($this->request->getPost('photo_id'));
        die; */


        if (!isset($dataForm['id'])) {
            $photoRoute = $this->uploadPhoto($this->request->getFile('photo_id'), $dataForm['code']);
            $dataForm['photo_id'] = $photoRoute;

            $this->EmpleadosModels->insert($dataForm);

            return redirect()->to(base_url('Empleados'));
        } else {

            $photoRoute = $this->uploadPhoto($this->request->getFile('photo_id'), $dataForm['code']);

            $dataForm['photo_id'] = $photoRoute;

            $this->EmpleadosModels->update($dataForm['id'], $dataForm);

SELECT *
FROM `empleados`
WHERE `empleados`.`id` = '9'
DELETE FROM `empleados`
WHERE `id` IN ('9')
---
    public function delete()
    {

        $dataForm = $this->request->getPost();

        $employee = $this->EmpleadosModels->find($dataForm['id']);

        $absolutePath = ROOTPATH.$employee['photo_id'];
        unlink($absolutePath);
        $this->EmpleadosModels->delete($dataForm['id']);